Revit 2027 API
CableType.SetCableSizeUsable Method
 Marks the Cable Size can be used by this Cable Type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCableSizeUsable(
	ElementId cableSizeId,
	bool usable
)
Public Sub SetCableSizeUsable (
	cableSizeId As ElementId,
	usable As Boolean
)
public:
void SetCableSizeUsable(
	ElementId^ cableSizeId,
	bool usable
)
member SetCableSizeUsable :
        cableSizeId : ElementId *
        usable : bool -> unit
Parameters
cableSizeId ElementId
 The Cable Size id.
usable Boolean
 The Cable Size can be used by this Cable Type or not.
Exceptions
Exception | Condition
ArgumentException |  The id is not a Cable Size id.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace